Repository: malakmagdy1/project
Catalog: lib/l10n/app_*.arb
Languages: ar

# welcomeTitle
source: Welcome to MoveEZ
ar: اهلاً بك في MoveEZ

# loginButton
source: Login
ar: تسجيل

source: First Name
ar: الاسم الأول

source: Last Name
ar: الاسم الأخير

source: Email
ar: البريد الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: ID Upload
ar: رفع الهوية

# id_upload_desc
source: Drag & drop or click to upload
ar: اسحب وأفلت أو اضغط للتحميل

# selectPackageTitle
source: Choose Your Package
ar: اختر الباقة

# floorFrom
source: From Floor
ar: من طابق

# floorTo
source: To Floor
ar: إلى طابق

source: Elevator
ar: المصعد

# numRooms
source: Number of Rooms
ar: عدد الغرف

# numBoxes
source: Number of Boxes
ar: عدد الصناديق

# nextButton
source: Next
ar: متابعة

# setupTripTitle
source: Setup Your Trip
ar: إعداد الرحلة

source: Pickup Address
ar: عنوان الاستلام

source: Delivery Address
ar: عنوان التسليم

source: Street
ar: الشارع

source: City
ar: المدينة

# state
source: State / Province
ar: المنطقة / الولاية

# zipCode
source: Postal Code
ar: الرمز البريدي

source: Confirm Location
ar: تأكيد الموقع

# selectDateTitle
source: Select Date
ar: اختر التاريخ

source: Today
ar: اليوم

source: Tomorrow
ar: غداً

source: Choose Time
ar: اختر الوقت

# searchOffers
source: Search for Offers
ar: ابحث عن عرض

# offersTitle
source: Offers
ar: العروض

source: Accept Offer
ar: قبول العرض

source: View Details
ar: عرض التفاصيل

# priceCurrency
source: USD
ar: دولار

# chatTitle
source: Chat with Fast Transport Company
ar: الدردشة مع شركة النقل السريع

# paymentMethodTitle
source: Select Payment Method
ar: اختر طريقة الدفع

# paymentMethodSubtitle
source: Choose how you'd like to pay for the service.
ar: اختر كيف تحب أن تدفع مقابل الخدمة.

# creditCardOption
source: Credit/Debit Card
ar: بطاقة ائتمان/خصم

# creditCardSubtitle
source: Pay securely online with Visa, Mastercard, and other major cards.
ar: ادفع بأمان عبر الإنترنت باستخدام فيزا أو ماستركارد أو بطاقات أخرى.

# cashPaymentOption
source: Cash Payment
ar: الدفع نقدًا

# cashPaymentSubtitle
source: Pay the driver directly in cash after the service is completed.
ar: ادفع للسائق مباشرةً نقدًا بعد اكتمال الخدمة.

source: Continue to Summary
ar: متابعة إلى الملخص

# addCardTitle
source: Add Your Card Details
ar: أضف تفاصيل بطاقتك

# addCardSubtitle
source: Your payment information is encrypted and stored securely.
ar: يتم تشفير معلومات الدفع الخاصة بك وتخزينها بأمان.

source: Card Number
ar: رقم البطاقة

source: Cardholder Name
ar: اسم حامل البطاقة

# cardholderHint
source: Name as it appears on the card
ar: الاسم كما يظهر على البطاقة

source: Expiry Date
ar: تاريخ الانتهاء

source: CVV
ar: رمز CVV

# saveCard
source: Save this card for faster payments in the future
ar: احفظ هذه البطاقة لمدفوعات أسرع في المستقبل

# addCardButton
source: Add Card
ar: إضافة البطاقة

# reviewTitle
source: Review & Confirm Your Booking
ar: مراجعة وتأكيد الحجز

source: Booking Summary
ar: ملخص الحجز

source: Service Fee
ar: رسوم الخدمة

source: Service Tax
ar: ضريبة الخدمة

source: Total Amount Due
ar: المبلغ الإجمالي المستحق

source: Payment Method
ar: طريقة الدفع

source: Change
ar: تغيير

# confirmPayment
source: Pay {amount} and Confirm
ar: ادفع {amount} و أكد

# register_as
source: Register as a...
ar: سجّل كـ...

source: Choose Your Path
ar: اختر مسارك

source: Independent Vehicle Owner
ar: مالك مركبة مستقل

# independent_vehicle_owner_desc
source: Manage your fleet, set your rates, and accept jobs directly.
ar: أدِر أسطولك، حدّد أسعارك، واقبل الطلبات مباشرةً.

source: Registered Transport Company
ar: شركة نقل مسجّلة

# registered_transport_company_desc
source: Register your company, define your service offerings, and expand your reach.
ar: سجّل شركتك، عرّف خدماتك، ووسّع نطاق وصولك.

source: Select Vehicles
ar: اختيار المركبات

# choose_vehicle_types
source: Choose your vehicle types
ar: اختر أنواع المركبات

# select_vehicles_desc
source: Select the vehicles and quantities required for your move.
ar: اختر المركبات والكميات المطلوبة لنقلك.

# small_transport
source: Pickup / Van
ar: نص نقل (بيك أب / فان)

# small_transport_desc
source: Ideal for small apartment moves or single-item transport.
ar: مثالية لنقل شقق صغيرة أو عنصر واحد.

# small_transport_capacity
source: Up to 1.5 tons
ar: حتى 1.5 طن

# medium_transport
source: Box Truck
ar: متوسطة النقل (شاحنة صندوقية)

# medium_transport_desc
source: Suitable for 1-2 bedroom apartments or office equipment.
ar: مناسبة لشقق 1-2 غرفة نوم أو معدات مكتبية.

# medium_transport_capacity
source: Up to 3 tons
ar: حتى 3 أطنان

# heavy_transport
source: Large Box Truck
ar: شاحنة كبيرة (صندوقية كبيرة)

# heavy_transport_desc
source: Perfect for large homes, commercial moves, or heavy cargo.
ar: مثالية للمنازل الكبيرة أو النقل التجاري أو البضائع الثقيلة.

# heavy_transport_capacity
source: Over 5 tons
ar: أكثر من 5 أطنان

source: Next
ar: التالي

source: Company Registration
ar: تسجيل الشركة

source: Select Services Offered
ar: اختر الخدمات المقدمة

source: Furniture Moving
ar: نقل الأثاث

source: General Goods & Cargo
ar: البضائع والشحن العام

source: Company Details
ar: تفاصيل الشركة

source: Company Name
ar: اسم الشركة

# company_name_value
source: MoveFlow Logistics
ar: موف فلو لوجستكس

source: Company Address
ar: عنوان الشركة

# company_address_value
source: 123 Main Street, Anytown, USA 12345
ar: 123 شارع رئيسي، أي مدينة، الولايات المتحدة 12345

source: Phone Number
ar: رقم الهاتف

source: Email Address
ar: البريد الإلكتروني

source: Business License Upload
ar: رفع رخصة العمل

# business_license_upload_desc
source: Drag & drop or click to upload
ar: اسحب وأفلت أو اضغط للتحميل

source: Register Company
ar: تسجيل الشركة

source: Company Profile
ar: ملف الشركة

source: Owner Name
ar: اسم المالك

# owner_name_value
source: Jane Doe
ar: جين دو

source: License Number
ar: رقم الترخيص

source: Contact Information
ar: معلومات الاتصال

source: Security
ar: الأمان

source: Password
ar: كلمة المرور

source: Edit
ar: تعديل

source: Save Changes
ar: حفظ التغييرات

source: Notifications
ar: الإشعارات

# new_message
source: New message from client {clientName}.
ar: رسالة جديدة من العميل {clientName}.

# new_message_desc
source: Regarding your recent price offer for job #{jobId}
ar: بخصوص عرض السعر الأخير الخاص بك للطلب #{jobId}

source: New
ar: جديد

# job_status_update
source: Job #{jobId} status updated.
ar: تم تحديث حالة الطلب #{jobId}.

# job_status_update_desc
source: The client has confirmed the pickup time. Review
ar: قام العميل بتأكيد وقت الاستلام. يرجى المراجعة

# price_offer_sent
source: Price offer sent for job #{jobId}.
ar: تم إرسال عرض السعر للطلب #{jobId}.

# price_offer_sent_desc
source: Offer for transportation of office furniture to client
ar: عرض لنقل أثاث المكتب إلى العميل

# critical_maintenance
source: Critical system maintenance scheduled.
ar: تم جدولة صيانة نظام حرجة.

# critical_maintenance_desc
source: Our services will be briefly interrupted on {date} at {time}
ar: سيتم إيقاف خدماتنا مؤقتًا في {date} الساعة {time}

source: Request Details
ar: تفاصيل الطلب

# client_name
source: Sarah Johnson
ar: سارة جونسون

# request_id
source: Request ID: {requestId}
ar: معرّف الطلب: {requestId}

source: New Request
ar: طلب جديد

source: Pickup:
ar: الاستلام:

# pickup_address
source: 123 Maple Ave, Cityville, CA
ar: 123 شارع مابل، سيتي فيل، كاليفورنيا

source: Drop-off:
ar: التسليم:

# dropoff_address
source: 456 Oak Blvd, Townsville, CA
ar: 456 شارع أوك، تاونزفيل، كاليفورنيا

source: Service Type:
ar: نوع الخدمة:

# service_type_value
source: Full Home Move
ar: نقل منزل كامل

source: Date/Time
ar: التاريخ / الوقت

# date_time_value
source: December 15, 2023, 10:00 AM
ar: 15 ديسمبر 2023، 10:00 صباحًا

source: Notes:
ar: ملاحظات:

# notes_value
source: Fragile items included, especially glassware. Needs extra care with antique furniture.
ar: توجد عناصر قابلة للكسر خاصة الزجاجيات. يحتاج الأمر لعناية إضافية مع الأثاث العتيق.

source: Send Offer
ar: إرسال العرض

source: Manage Job
ar: إدارة الطلب

source: Financial Summary
ar: ملخص مالي

source: Overall Performance
ar: ملخص الأداء الكلي

# total_amount
source: {amount} SAR
ar: {amount} ر.س

source: Profit Share
ar: نصيب الأرباح

# original_amount
source: Original Amount in SAR
ar: المبلغ الأصلي بعملة ر.س

source: Actions
ar: الإجراءات

source: View Report
ar: عرض التقرير

# order_id
source: Order ID {orderId} {date}
ar: رقم الطلب {orderId} {date}

source: Order Type
ar: نوع الطلب

source: Delivery
ar: توصيل

source: Shipping
ar: شحن

# previous_share
source: Previous Share: {amount} SAR
ar: النصيب السابق: {amount} ر.س

source: Company Share
ar: نصيب الشركة

source: Client Share
ar: نصيب العميل

source: Total Goods
ar: إجمالي السلع

# total_amount_value
source: Total Amount: {amount} SAR
ar: المبلغ الكلي: {amount} ر.س

# payment_invoice
source: Pay Invoice
ar: دفع الفاتورة

source: Order Details
ar: الطلبات التفصيلية
